Documents/СМГ_План_Выработки_Сотрудников_По_Сервисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СМГ_План_Выработки_Сотрудников_По_Сервисам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СМГ_ПланыПоСотрудникамВРазрезеЦехов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаМесяца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Планы_Сервисов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сервис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сервисы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ГрафикРаботКалендарный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботКалендарный</Name>
			<Comment>График работ календарный</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Comment>Вид дня</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДня</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Банковский</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИнтервала</Name>
					<Comment>Вид интервала</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнтервалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Comment>График</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
					<Comment>Начало рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецРабочегоВремени</Name>
					<Comment>Конец рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Comment>Смена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СМГ_РабочиеДниМастеровПриемщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СМГ_РабочиеДниМастеровПриемщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидДня</Name>
			<Comment>Вид дня</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>Предпраздничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>Праздник</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выходной</Name>
					<Comment>Выходной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
					<Comment>Сотрудник находится в командировке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Компания, к которой относится сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Comment>Дата приема на работу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Comment>Дата увольнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагУволен</Name>
					<Comment>Флаг уволен</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения сотрудника</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньРождения</Name>
					<Comment>Месяц и число дня рождения сотрудника для сортировки списка по дням рождения. Формируется автоматически от даты рождения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Признак сотрудника как исполнителя работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Основной цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольУРВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефон</Name>
					<Comment>Номер внутреннего рабочего телефона сотрудника</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефонСотовый</Name>
					<Comment>Корпоративный рабочий сотовый телефон</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДТ_ОкладДляМотивации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДТ_Окладник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>telegramId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезОтчества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалённыйРежимРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПодразделенийРаботы</Name>
					<Comment>Таблица подразделений, в которых работает сотрудник</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПодразделенийГК</Name>
					<Comment>Таблица подразделений Группы Компаний, в которых работает сотрудник</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеГК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СМГ_План_Выработки_Сотрудников_По_Сервисам/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//1 Получим все сервисы, их планы и количества рабочих дней; сотрудников (в т.ч. подчиненных подразделений), 
	//количества их рабочих дней и вид первого дня месяца 
	Запрос = Новый Запрос;     
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СервисыПодразделения.Подразделение КАК Подразделение,
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Сервис КАК Сервис,
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.План КАК План
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.СМГ_План_Выработки_Сотрудников_По_Сервисам.Планы_Сервисов КАК СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сервисы.Подразделения КАК СервисыПодразделения
	|		ПО СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Сервис = СервисыПодразделения.Ссылка
	|ГДЕ
	|	СМГ_План_Выработки_Сотрудников_По_СервисамПланы_Сервисов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВТ_Док.Сервис КАК Сервис,
	|	ВТ_Док.План КАК План
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док КАК ВТ_Док
	|		ПО (ВЫБОР
	|				КОГДА Сотрудники.Подразделение = ВТ_Док.Подразделение
	|					ТОГДА Сотрудники.Подразделение
	|				ИНАЧЕ Сотрудники.Подразделение.Родитель
	|			КОНЕЦ = ВТ_Док.Подразделение)
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ФлагУволен
	|	И Сотрудники.Должность = &Должность
	|	И Сотрудники.ДатаПриема <= &НачалоМесяца
	|	И Сотрудники.Подразделение В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТ_Док.Подразделение КАК Ссылка
	|			ИЗ
	|				ВТ_Док КАК ВТ_Док)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_Сотрудники.Сервис КАК Сервис,
	|	ВТ_Сотрудники.План КАК План,
	|	КОЛИЧЕСТВО(ГрафикРаботКалендарный.Дата) КАК КоличествоРД
	|ПОМЕСТИТЬ ВТ_РДКалендарь
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|		ПО ВТ_Сотрудники.Сотрудник.ГрафикРаботы = ГрафикРаботКалендарный.График
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ГрафикРаботКалендарный.ВидДня = &ВидДня
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сотрудники.Сотрудник,
	|	ВТ_Сотрудники.Сервис,
	|	ВТ_Сотрудники.План
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РДКалендарь.Сотрудник КАК Сотрудник,
	|	ВТ_РДКалендарь.Сервис КАК Сервис,
	|	ГрафикРаботКалендарный.ВидДня КАК ВидДня
	|ПОМЕСТИТЬ ВТ_ВидДня
	|ИЗ
	|	ВТ_РДКалендарь КАК ВТ_РДКалендарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|		ПО ВТ_РДКалендарь.Сотрудник.ГрафикРаботы = ГрафикРаботКалендарный.График
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата = &Началомесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_Сотрудники.Сервис КАК Сервис,
	|	ЕСТЬNULL(ВТ_РДКалендарь.КоличествоРД, ДЕНЬ(&КонецМесяца)) КАК КоличествоРД,
	|	ЕСТЬNULL(ВТ_ВидДня.ВидДня, ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)) КАК ВидДня,
	|	ВТ_Сотрудники.План КАК План
	|ПОМЕСТИТЬ ВТ_ВидКолРДСотрудники
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РДКалендарь КАК ВТ_РДКалендарь
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_РДКалендарь.Сотрудник
	|			И ВТ_Сотрудники.Сервис = ВТ_РДКалендарь.Сервис
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидДня КАК ВТ_ВидДня
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_ВидДня.Сотрудник
	|			И ВТ_Сотрудники.Сервис = ВТ_ВидДня.Сервис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидКолРДСотрудники.Сервис КАК Сервис,
	|	ВТ_ВидКолРДСотрудники.План КАК План,
	|	СУММА(ВТ_ВидКолРДСотрудники.КоличествоРД) КАК КоличествоРД
	|ПОМЕСТИТЬ ВТ_КолРДСервисы
	|ИЗ
	|	ВТ_ВидКолРДСотрудники КАК ВТ_ВидКолРДСотрудники
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВидКолРДСотрудники.Сервис,
	|	ВТ_ВидКолРДСотрудники.План
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидКолРДСотрудники.Сотрудник КАК Сотрудник,
	|	ВТ_КолРДСервисы.Сервис КАК Сервис,
	|	ВТ_ВидКолРДСотрудники.КоличествоРД КАК КоличествоРД,
	|	ВЫБОР
	|		КОГДА ВТ_ВидКолРДСотрудники.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)
	|			ТОГДА ВТ_КолРДСервисы.План / ВТ_КолРДСервисы.КоличествоРД
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндивидуальныйПлан
	|ИЗ
	|	ВТ_ВидКолРДСотрудники КАК ВТ_ВидКолРДСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолРДСервисы КАК ВТ_КолРДСервисы
	|		ПО ВТ_ВидКолРДСотрудники.Сервис = ВТ_КолРДСервисы.Сервис";	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Запрос.УстановитьПараметр("Должность", Справочники.Должности.МастерПриемщик);
	Запрос.УстановитьПараметр("НачалоМесяца", ДатаНачалаМесяца);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ДатаНачалаМесяца));
	Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидДня.Рабочий);	
	                                                                               
	ВыгрузкаДанных = Запрос.Выполнить().Выгрузить();  
	
	//2 Обходим сотрудников, создаем записи в регистр на начало месяца	
	Набор_Записей_Планы = РегистрыСведений.СМГ_РабочиеДниМастеровПриемщиков.СоздатьНаборЗаписей(); 
	//Набор_Записей_Планы.Отбор.Период.Установить(ДатаНачалаМесяца);  
	//Набор_Записей_Планы.ОбменДанными.Загрузка = Ложь;
	
	Для Каждого Строка Из ВыгрузкаДанных Цикл
		Новая_Запись 					   = Набор_Записей_Планы.Добавить();
		Новая_Запись.Период    			   = ДатаНачалаМесяца;
		Новая_Запись.Сервис    			   = Строка.Сервис; 
		Новая_Запись.Сотрудник 			   = Строка.Сотрудник;
		Новая_Запись.КоличествоРабочихДней = Строка.КоличествоРД;
		Новая_Запись.ИндивидуальныйПлан    = Строка.ИндивидуальныйПлан;	
	КонецЦикла;	
	
	Попытка
		Набор_Записей_Планы.Записать();
	Исключение
		Сообщить("ОШИБКА! В указанном месяце уже установлен план по сервисам.", СтатусСообщения.ОченьВажное); 
		Возврат;
	КонецПопытки;	

КонецПроцедуры
